Tarea1/channel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3.5 0 0);

boundaryField
{
	frontback
	{
		type	empty;
	}
	outlet
	{
		type	zeroGradient;
	}
	inlet
	{
		type	surfaceNormalFixedValue;
		refValue	uniform -3.5;
	}
	Walls
	  {
	    type	noSlip;
	  }
}

// ************************************************************************* //
