Tarea1/channel/0/k
FoamFile
{
	version             2.0;
	format              ascii;
	class               volScalarField;
	location            "0";
	object              k;
}


dimensions	[0 2 -2 0 0 0 0];
internalField	uniform 0.009999999776482582;
boundaryField
{
	frontback
	{
		type	empty;
	}
	outlet
	{
		type	zeroGradient;
	}
	inlet
	{
		type	turbulentIntensityKineticEnergyInlet;
		value	uniform 0.009999999776482582;
		intensity	0.05;
	}
	walls
	{
		type	kqRWallFunction;
		value	uniform 0.009999999776482582;
	}
}
